<template>
  <v-expansion-panels class="mb-6">
    <v-expansion-panel rounded="lg">
      <v-expansion-panel-title>
        <span class="text-h6">Описание режима</span>
      </v-expansion-panel-title>

      <v-expansion-panel-text>
        <p class="text-body-2 mb-3">
          Интерфейс позволяет анализировать предложения корпуса по выбранной синтаксической метрике,
          лемме и дополнительным фильтрам. Выборку можно ограничить по автору,
          произведению, жанру, году создания текста и диапазону значений метрики.
        </p>
		<br>
        <p class="text-body-2 mb-3">
          В режиме <strong>«Распределение»</strong> строится гистограмма значений выбранной метрики.
        </p>
		<br>
        <p class="text-body-2 mb-3">
          В режиме <strong>«Средние по группам»</strong> можно увидеть среднее значение метрики
          для выбранных групп: авторов, произведений, жанров (столбчатый график) или десятилетий (линейный график).
        </p>
		<br>
        <p class="text-body-2 mb-3">
          В режиме <strong>«Объекты во времени»</strong> график показывает положение авторов,
          жанров или произведений во временной перспективе. Линия отражает среднее значение
          выбранной метрики по десятилетиям, а точки обозначают выбранные объекты. Для авторов
          и жанров положение по оси времени определяется десятилетием, в котором
          у объекта представлено больше всего произведений. Для произведений используется
          десятилетие их создания.
        </p>
		<br>
        <p class="text-body-2 mb-3">
          Примеры предложений выводятся после клика по элементу графика. Сначала показывается сводка по авторам, а после выбора автора — предложения,
          попавшие в выбранный диапазон. Для сгруппированных графиков примеры
          сортируются по близости значения метрики к среднему значению выбранной группы.
        </p>
		<br>
        <p class="text-body-2 mb-0">
          Примеры выводятся постранично: сначала показываются первые 10 предложений, затем можно
          перейти к следующей или предыдущей странице. Над графиком отображается краткая статистика
          по текущей выборке: количество предложений, авторов и произведений, среднее значение,
          медиана и диапазон значений метрики.
        </p>
      </v-expansion-panel-text>
    </v-expansion-panel>
  </v-expansion-panels>
</template>